export const titles = ["歲在", "歲次"];

export const months = [
  ['正月', '陬月', '寅孟月', '元春', '新春', '月正', '上月', '始春', '初歲', '太簇', '春首', '開歲', '端月', '歲始', '王月', '孟春', '謹月', '孟陬', '孟陽', '上春', '肇歲', '泰月', '初月', '王正月', '新陽', '元陽'],
  ['如月', '夾鐘', '仲春', '麗月', '四陽月', '令月', '春中', '中和月', '酣春', '婚月', '媒月', '水泮月', '仲陽', '杏月', '桃月'],
  ['蠶月', '姑洗', '桃李月', '禊月', '暮春', '季春', '嘉月', '五陽月', '竹秋', '花月', '桃月', '辰月', '桐月'],
  ['余月', '仲呂', '清和月', '乏月', '梅月', '麥秋月', '夏首', '正陽月', '孟夏', '始夏', '雩月', '畏月', '乾月', '農月', '六陽', '朱明', '夘月', '槐夏', '麥序', '乾月', '首夏', '槐月'],
  ['皐月', '蕤賓', '端陽月', '署月', '蒲月', '仲夏', '鶉月', '鳴蜩', '午月', '蒲夏', '榴月'],
  ['且月', '林鐘', '焦月', '未月', '遯月', '伏月', '晚夏', '季夏', '二陰月', '精陽', '荷月'],
  ['相月', '夷則', '涼月', '孟秋', '瓜月', '申月', '蘭月', '三陰月', '肇秋', '蘭秋', '孟商', '首秋', '初秋', '上秋'],
  ['壯月', '雁來月', '南呂', '桂月', '柘月', '商月', '清秋', '中律', '仲秋', '觀月', '正秋', '仲商', '四陰月'],
  ['玄月', '無射', '素秋', '菊月', '霜月', '季商', '五陰月', '戌月', '朽月', '季秋', '剝月', '菊序', '霜序', '杪秋'],
  ['陽月', '良月', '應鐘', '亥月', '孟冬', '小春', '玄冬', '上冬', '坤月', '初冬', '吉月'],
  ['辜月', '黃鐘', '暢月', '復月', '子月', '紙月', '天正月', '葭月', '茶月', '一陽月', '仲冬'],
  ['涂月', '大呂', '臘月', '蜡月', '餘月', '嘉平', '除月', '嚴月', '地正月', '二陽月', '冰月', '季冬', '杪冬', '丑月', '除臘', '椒月'],
];

export const ups = [
  "雅正",
  "雅屬",
  "教正",
  "清賞",
  "博鑒",
  "正之",
  "賜正",
  "清品",
  "惠存",
  "清玩",
];

export const downs = [
  "敬書",
  "臨",
  "題",
  "書",
  "節臨",
  "學書",
  "試筆",
  "撰題",
  "拙書",
];

export const xun1 = ["上旬", "上浣", "上瀚", "上澣"]; // 每月一日至十日
export const xun2 = ["中旬", "中浣", "中瀚", "中澣"]; // 每月十一日至二十日
export const xun3 = ["下旬", "下浣", "下瀚", "下澣"]; // 每月二十一日至三十日

// 落款順序：年+月+旬+地名+人名+下款（空ㄧ格）[用印]
